[
    {
        "url": "https://byjus.com/physics/magnet/",
        "title": "What is a Magnet?",
        "headings": [
            "Properties of Magnet",
            "Types of Magnets",
            "Permanent Magnet",
            "Temporary Magnet",
            "Electromagnets",
            "Characteristics of Magnet",
            "Uses of Magnets",
            "Frequently Asked Questions – FAQs"
        ],
        "main_findings": [
            "A magnet is defined as an object which is capable of producing magnetic field and attracting unlike poles and repelling like poles.",
            "Magnetic poles always exist in pairs.",
            "Like poles repel while unlike poles attract.",
            "The magnetic force between the two magnets is greater when the distance between these magnets is lesser."
        ],
        "content": "A magnet is defined as an object which is capable of producing magnetic field and attracting unlike poles and repelling like poles. Properties of Magnet The following are the basic properties of a magnet: ... (rest of the content)",
        "word_count": 52,
        "status": "success"
    },
    {
        "url": "https://byjus.com/physics/electricity-and-magnetism/",
        "title": "Electricity and Magnetism",
        "headings": [
            "What Is Electricity?",
            "Electron Movement",
            "Conductors",
            "Insulators",
            "Semiconductors",
            "What Is Magnetism?",
            "What Is a Magnetic Field",
            "Difference Between Electricity and Magnetism",
            "Frequently Asked Questions – FAQs"
        ],
        "main_findings": [
            "Electricity is the presence and motion of charged particles.",
            "Magnetism is a concept introduced in physics to help you understand one of the fundamental interactions in nature, the interaction between moving charges.",
            "The major difference between electricity and magnetism is their presence. Electricity can be present in a static charge, while magnetism's presence is only felt when there are moving charges as a result of electricity."
        ],
        "content": "Electricity and Magnetism... Electric current must begin with the nature of matter. All matter is composed of molecules. All molecules are made up of atoms, which are themselves made up of electrons, protons, and neutrons. ... Magnetic fields, like gravitational fields, cannot be seen or touched. We can feel the pull of the Earth's gravitational field on ourselves and the objects around us, but we do not experience magnetic fields in such a direct way.",
        "word_count": 66,
        "status": "success"
    },
    {
        "url": "https://www.vedantu.com/english-superstar?&utm_source=mau&utm_medium=seoSideBanner&utm_campaign=pagelanding&utm_term=vel_english_superstar&couponCode=",
        "title": null,
        "headings": [
            "Parts of the Microscope and Their Uses",
            "Amoeba",
            "Beaker Chemistry - What it is and How it is Used",
            "How Do Plants Grow?",
            "Water Cycle",
            "What are Leguminous Plants?"
        ],
        "main_findings": [
            "Here is the content from...",
            "Parts of the Microscope and Their Uses: ...",
            "Amoeba: ...",
            "Beaker Chemistry - What it is and How it is Used: ...",
            "How Do Plants Grow?: ...",
            "Water Cycle: ...",
            "What are Leguminous Plants?: ..."
        ],
        "content": null,
        "word_count": 40,
        "status": "success"
    },
    {
        "url": "https://byjus.com/",
        "title": "Magnetic Field",
        "headings": [
            "Why are magnetic flux lines important?",
            "What causes the Earth's magnetic field?",
            "Define magnetic field",
            "Define magnetic flux density"
        ],
        "main_findings": [
            "Magnetic Field is the region around a magnetic material or a moving electric charge within which the force of magnetism acts.",
            "The Earth's magnetic field is generated deep down the Earth's core.",
            "Magnetic field intensity is a ratio of the MMF needed to create a certain flux density (B) within a particular material per unit length of that material."
        ],
        "content": "Magnetic Field is the region around a magnetic material or a moving electric charge within which the force of magnetism acts. What causes the Earth's magnetic field? The flow of liquid iron at the centre of the Earth generates an electric current that produces magnetic fields. Charged metals passing through these fields create electric currents of their own, so the cycle continues. This self-sustaining loop is known as the geodynamo.",
        "word_count": 59,
        "status": "success"
    },
    {
        "url": "https://byjus.com/physics/uses-of-magnets/",
        "title": "How are Magnets Useful?",
        "headings": [
            "Various Applications and Uses of Magnets"
        ],
        "main_findings": [
            "Magnets have been proving their worth every day with their incredible function by making the most strenuous tasks easier.",
            "With the various uses of magnets in daily life, we can do heavy lifting which is not humanly possible to do every day.",
            "Magnets play an important role in various devices which can be a small toy or a heavy 100-ton device to pick up heavy metals."
        ],
        "content": "Magnets have been proving their worth every day with their incredible function by making the most strenuous tasks easier. With the various uses of magnets in daily life, we can do heavy lifting which is not humanly possible to do every day. Magnets play an important role in various devices which can be a small toy or a heavy 100-ton device to pick up heavy metals.",
        "word_count": 66,
        "status": "success"
    },
    {
        "url": "https://byjus.com/physics/electromagnetism/",
        "title": "Electromagnetism",
        "headings": [
            "What is Electromagnetic Force?",
            "What is Electromagnetism?",
            "Explanation of Electromagnetism with an Example",
            "Electromagnetic Induction",
            "Faraday's Law",
            "Properties of the Electromagnetic Wave",
            "Applications of Electromagnetism",
            "Frequently Asked Questions – FAQs"
        ],
        "main_findings": [
            "The electromagnetic force is a type of physical interaction that occurs between electrically charged particles.",
            "It acts between charged particles and is the combination of all magnetic and electrical forces.",
            "Electromagnetism serves as a fundamental working principle for many of the home appliances in household applications.",
            "The Maglev trains or high-speed trains work on the principle of electromagnetism.",
            "Electromagnetic radiations are used in the communication system to transfer data from the source to the receiver."
        ],
        "content": "Electromagnetism is a branch of Physics, that deals with the electromagnetic force that occurs between electrically charged particles. The electromagnetic force is one of the four fundamental forces and exhibits electromagnetic fields such as magnetic fields, electric fields, and light. It is the basic reason electrons are bound to the nucleus and are responsible for the complete structure of the nucleus. ... (rest of the content)",
        "word_count": 75,
        "status": "success"
    },
    {
        "url": "https://byjus.com/physics/poles-of-magnets/",
        "title": "Poles of Magnets",
        "headings": [
            "What Is a Magnetic Pole?",
            "Magnetic Field Lines",
            "Properties of Magnetic Field Lines"
        ],
        "main_findings": [
            "The areas of magnets that have magnetic strength are called “poles.”",
            "Opposite poles always attract each other while like poles repel each other.",
            "For all magnets, the point at which all magnetic field lines converge is the south pole and the point from which all magnetic field lines diverge will be the magnetic north pole."
        ],
        "content": "The areas of magnets that have magnetic strength are called “poles.” When we have more than one magnet poles repel, pull or attract each other. Opposite poles always attract each other while like poles repel each other. These acts of attraction and repulsion are known as magnetism. And, the magnetic space around a magnet is known as magnetism. ... For all magnets, the point at which all magnetic field lines converge is the south pole and the point from which all magnetic field lines diverge will be the magnetic north pole.",
        "word_count": 55,
        "status": "success"
    },
    {
        "url": "https://byjus.com/",
        "title": "Moving Charges and Magnetism",
        "headings": [
            "Force on a Current Carrying Conductor in a Magnetic Field",
            "Biot-Savart's Law",
            "Ampere's Circuital Law"
        ],
        "main_findings": [
            "The magnetic effect of an electric current is the phenomenon where a current flowing through a conductor sets up a magnetic field around it.",
            "Laplace's law or Biot-Savart's law is used to determine the flux density of the magnetic field at a point due to the current element.",
            "A solenoid is a cylindrical coil made of several turns of wire."
        ],
        "content": "The magnetic effect of an electric current... Laplace's law or Biot-Savart's law is used to determine the flux density of the magnetic field at a point due to the current element. A solenoid is a cylindrical coil made of several turns of wire.",
        "word_count": 60,
        "status": "success"
    },
    {
        "url": "https://byjus.com/chemistry/magnetic-properties-of-solids/",
        "title": "What are Magnetic Properties of Solids?",
        "headings": [
            "Magnetic Properties",
            "Graph showing the variation of magnetic properties on changing with temperature",
            "Frequently Asked Questions – FAQs"
        ],
        "main_findings": [
            "Every substance around us has some magnetic properties in it.",
            "Different types of materials show different properties in the presence of a magnetic field.",
            "The magnetic properties of a substance originate from the electrons present in the atoms or molecules.",
            "Every electron in an atom behaves like a small magnet.",
            "Electrons can also be referred to as small loops of current which retain their magnetic moment.",
            "On the basis of the magnetic properties solids can be classified as follows:",
            "Diamagnetic: They are weakly repelled by the magnetic fields",
            "Paramagnetic: They are weakly attracted by the magnetic fields.",
            "Ferromagnetic: Strongly attracted by the magnetic field. It can be magnetized permanently",
            "Antiferromagnetic: Net magnetic moment is zero. Dipole moments are arranged in a compensatory way",
            "Ferrimagnetic: Possess small net magnetic moments Unequal number of parallel and antiparallel arrangement of magnetic moments"
        ],
        "content": "Every substance around us has some magnetic properties in it. Different types of materials show different properties in the presence of a magnetic field. The magnetic properties of a substance originate from the electrons present in the atoms or molecules. Every electron in an atom behaves like a small magnet. Electrons can also be referred to as small loops of current which retain their magnetic moment. On the basis of the magnetic properties solids can be classified as follows: Diamagnetic: They are weakly repelled by the magnetic fields Paramagnetic: They are weakly attracted by the magnetic fields. Ferromagnetic: Strongly attracted by the magnetic field. It can be magnetized permanently Antiferromagnetic: Net magnetic moment is zero. Dipole moments are arranged in a compensatory way Ferrimagnetic: Possess small net magnetic moments Unequal number of parallel and antiparallel arrangement of magnetic moments",
        "word_count": 139,
        "status": "success"
    },
    {
        "url": "https://byjus.com/physics/discovery-magnets/",
        "title": "Discovery of Magnets",
        "headings": [
            "History of Magnets",
            "Magnets"
        ],
        "main_findings": [
            "Magnetism was first discovered by a shepherd named Magnes, who lived in Magnesia, Greece.",
            "The stone was named magnetite, after the name of the shepherd or the country it was found in.",
            "It gets attracted to magnets and can be easily magnetized to form a permanent magnet.",
            "Naturally magnetized pieces of magnetite are called loadstone.",
            "People from Ancient Egypt started using magnets to play tricks, by making objects of worship float in mid-air by proper positioning of magnets.",
            "The emperor from China used magnets to save his palace by constructing gates made of loadstone.",
            "William Gilbert mentioned techniques of artificially making magnets from steel.",
            "Hans Christian Orsted discovered electromagnetism."
        ],
        "content": "Magnetism was first discovered by a shepherd named Magnes, who lived in Magnesia, Greece. The stone was named magnetite, after the name of the shepherd or the country it was found in. It gets attracted to magnets and can be easily magnetized to form a permanent magnet. Naturally magnetized pieces of magnetite are called loadstone. People from Ancient Egypt started using magnets to play tricks, by making objects of worship float in mid-air by proper positioning of magnets. The emperor from China used magnets to save his palace by constructing gates made of loadstone. William Gilbert mentioned techniques of artificially making magnets from steel. Hans Christian Orsted discovered electromagnetism.",
        "word_count": 109,
        "status": "success"
    }
]